[
	{
		"id": "9781368090131",
		"idCategoria": 1,
		"Title": "Look Out for the Little Guy",
		"TitleL": "Look Out for the Little Guy",
		"Publisher": "Disney Publishing",
		"Date": "09/05/2023",
		"Pages": 256,
		"Tracks": 0,
		"Rating": "",
		"Price": 23.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781368090131.webp?alt=media&token=cc9a0a6b-726d-45a0-b8e2-5119aed3d44c",
		"Stock": 100,
		"Review": "Look Out for the Little Guy is the in-movie memoir by Scott Lang, also known as Ant-Man, that he’s written and shared with the world, as seen onscreen in the new Marvel Studios film Ant-Man and The Wasp: Quantumania. Hyperion Avenue is proud to bring this book to real life. This is the incredible story of an ex-con turned world-saving Super Hero. In Look Out for the Little Guy, Scott Lang shares with the world a bracingly honest account of his struggles and triumphs, from serving time to being a divorced dad to becoming Ant-Man and joining The Avengers. These are stories of epic battles won and lost, as this everyman turned Super Hero finally tells all—from the official account of what really happened between The Avengers and Thanos to how shrinking down to ant-size really feels to the challenges of balancing the roles of hero and dad."
	},
	{
		"id": "9781619636125",
		"idCategoria": 1,
		"Title": "Kingdom of Ash",
		"TitleL": "Kingdom of Ash (Throne of Glass Series #7)",
		"Publisher": "Bloomsbury USA",
		"Date": "10/08/2019",
		"Pages": 992,
		"Tracks": 0,
		"Rating": "",
		"Price": 11.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781619636125.webp?alt=media&token=c6a8cd04-2360-4675-bb7c-535527f8854a",
		"Stock": 100,
		"Review": "Together they will rise. Or together they will fall. The epic finale to the #1 bestselling Throne of Glass series by Sarah J. Maas. Aelin Galathynius has vowed to save her people-but at a tremendous cost. Locked in an iron coffin by the Queen of the Fae, Aelin must draw upon her fiery will as she endures months of torture. The knowledge that yielding to Maeve will doom those she loves keeps her from breaking, but her resolve unravels with each passing day."
	},
	{
		"id": "9780593593806",
		"idCategoria": 2,
		"Title": "Spare",
		"TitleL": "Spare",
		"Publisher": "Random House Publishing",
		"Date": "01/10/2023",
		"Pages": 416,
		"Tracks": 0,
		"Rating": "",
		"Price": 25.20,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9780593593806.webp?alt=media&token=04a5a592-d6b1-4db3-93c2-ceb95fd348df",
		"Stock": 100,
		"Review": "It was one of the most searing images of the twentieth century: two young boys, two princes, walking behind their mother’s coffin as the world watched in sorrow—and horror. As Princess Diana was laid to rest, billions wondered what Prince William and Prince Harry must be thinking and feeling—and how their lives would play out from that point on. For Harry, this is that story at last."
	},
	{
		"id": "9780593237465",
		"idCategoria": 2,
		"Title": "The Light We Carry: Overcoming in Uncertain Times",
		"TitleL": "The Light We Carry: Overcoming in Uncertain Times",
		"Publisher": "Crown Publishing Group",
		"Date": "11/15/2022",
		"Pages": 336,
		"Tracks": 0,
		"Rating": "",
		"Price": 26.00,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9780593237465.webp?alt=media&token=7c7ade43-b0d7-4ca0-9878-c82c431ab4a1",
		"Stock": 100,
		"Review": "Former First Lady Michelle Obama shares practical wisdom and powerful strategies for staying hopeful and balanced in todays highly uncertain world. Drawing from her experiences as a mother, daughter, spouse, friend and First Lady, she shares the habits and principles she has developed to successfully adapt to change and overcome various obstacles — the earned wisdom that helps her continue to become."
	},
	{
		"id": "9780345539434",
		"idCategoria": 3,
		"Title": "Cosmos",
		"TitleL": "Cosmos",
		"Publisher": "Random House Publishing",
		"Date": "12/10/2013",
		"Pages": 432,
		"Tracks": 0,
		"Rating": "",
		"Price": 15.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9780345539434.webp?alt=media&token=6e695f77-c22c-4dc5-ba25-b671ecd7da04",
		"Stock": 100,
		"Review": "Cosmos is one of the bestselling science books of all time. In clear-eyed prose, Sagan reveals a jewel-like blue world inhabited by a life form that is just beginning to discover its own identity and to venture into the vast ocean of space. Featuring a new Introduction by Sagan’s collaborator, Ann Druyan, full color illustrations, and a new Foreword by astrophysicist Neil deGrasse Tyson, Cosmos retraces the fourteen billion years of cosmic evolution that have transformed matter into consciousness, exploring such topics as the origin of life, the human brain, Egyptian hieroglyphics, spacecraft missions, the death of the Sun, the evolution of galaxies, and the forces and individuals who helped to shape modern science."
	},
	{
		"id": "9781335463548",
		"idCategoria": 3,
		"Title": "The Possibility of Life",
		"TitleL": "The Possibility of Life: Science, Imagination, and Our Quest for Kinship in the Cosmos",
		"Publisher": "Hanover Square Press",
		"Date": "04/18/2023",
		"Pages": 304,
		"Tracks": 0,
		"Rating": "",
		"Price": 32.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781335463548.webp?alt=media&token=016ba8ca-4645-4a12-ba9f-a999d6d5dd5c",
		"Stock": 100,
		"Review": "Every page of this book makes our shared universe feel larger and more interesting than ever before, a true gift of fascinating science and engrossing storytelling. —Matt Bell, author of Appleseed. A spellbinding exploration of alien life and the cosmos, examining how the possibility of life on other planets shapes our understanding of humanity. One of the most powerful questions humans ask about the cosmos is: Are we alone? While the science behind this inquiry is fascinating, it doesn’t exist in a vacuum. It is a reflection of our values, our fears, and most importantly, our enduring sense of hope."
	},
	{
		"id": "9781400033720",
		"idCategoria": 3,
		"Title": "Parallel Worlds",
		"TitleL": "Parallel Worlds: A Journey Through Creation, Higher Dimensions, and the Future of the Cosmos",
		"Publisher": "Knopf Doubleday Publishing",
		"Date": "02/14/2006",
		"Pages": 448,
		"Tracks": 0,
		"Rating": "",
		"Price": 16.00,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781400033720.webp?alt=media&token=56416f30-3ae6-4bc7-b468-71ae9e52d4a3",
		"Stock": 100,
		"Review": "In this thrilling journey into the mysteries of our cosmos, bestselling author Michio Kaku takes us on a dizzying ride to explore black holes and time machines, multidimensional space and, most tantalizing of all, the possibility that parallel universes may lay alongside our own. Kaku skillfully guides us through the latest innovations in string theory and its latest iteration, M-theory, which posits that our universe may be just one in an endless multiverse, a singular bubble floating in a sea of infinite bubble universes. If M-theory is proven correct, we may perhaps finally find answer to the question, “What happened before the big bang?” This is an exciting and unforgettable introduction into the new cutting-edge theories of physics and cosmology from one of the pre-eminent voices in the field."
	},
	{
		"id": "9781259588501",
		"idCategoria": 4,
		"Title": "Marks Standard Handbook for Mechanical Engineers",
		"TitleL": "Marks Standard Handbook for Mechanical Engineers, 12th Edition / Edition 12",
		"Publisher": "McGraw-Hill Professional",
		"Date": "11/08/2017",
		"Pages": 1536,
		"Tracks": 0,
		"Rating": "",
		"Price": 154.00,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781259588501.webp?alt=media&token=6f636d55-abf9-47ba-8168-21f45fb66a19",
		"Stock": 100,
		"Review": "This 100th Anniversary Edition has been extensively updated to deliver current, authoritative coverage of the topics most critical to today’s Mechanical Engineer. Featuring contributions from more than 160 global experts, Marks’ Standard Handbook for Mechanical Engineers, Twelfth Edition, offers instant access to a wealth of practical information on every essential aspect of mechanical engineering. It provides clear, concise answers to thousands of mechanical engineering questions. You get, accurate data and calculations along with clear explanations of current principles, important codes, standards, and practices. All-new sections including Applied Mechanics, Engineering Ethics, Digital Control Systems, Sensor and Actuators, Vehicle Electrification and Hybridization, and Nondestructive Testing."
	},
	{
		"id": "9798986769318",
		"idCategoria": 4,
		"Title": "Engineering Management for the Rest of Us",
		"TitleL": "Engineering Management for the Rest of Us",
		"Publisher": "Skill Recordings Inc",
		"Date": "11/01/2022",
		"Pages": 220,
		"Tracks": 0,
		"Rating": "",
		"Price": 17.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9798986769318.webp?alt=media&token=99a42c3e-e210-4f97-b93d-70e0211b7f26",
		"Stock": 100,
		"Review": "A lot of Engineering Managers and leaders studied for years and years to become the best Engineer they possibly could be... and then they were promoted. It can be very tough for those of us who didnt go into Engineering with the distinct concept that we would become managers, but still want to do our best to support our teams. I wrote this book because theres so much no one told me about management that I wished I would have known. Theres a lot to be purposeful about that many of us learn on the job, and worse: learn on people. This book provides some organization for collaborating with networks of people, working together towards a common purpose."
	},
	{
		"id": "9780198725725",
		"idCategoria": 4,
		"Title": "A Dictionary of Electronics and Electrical Engineering",
		"TitleL": "A Dictionary of Electronics and Electrical Engineering",
		"Publisher": "Oxford University Press",
		"Date": "08/21/2018",
		"Pages": 720,
		"Tracks": 0,
		"Rating": "",
		"Price": 18.95,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9780198725725.webp?alt=media&token=0033a197-81f9-41fd-85d6-032d7d846b0c",
		"Stock": 100,
		"Review": "This popular dictionary, formerly published as the Penguin Dictionary of Electronics, has been extensively revised and updated, providing more than 5,000 clear, concise, and jargon-free A-Z entries on key terms, theories, and practices in the areas of electronics and electrical science. Topics covered include circuits, power, systems, magnetic devices, control theory, communications, signal processing, and telecommunications, together with coverage of applications areas such as image processing, storage, and electronic materials. The dictionary is enhanced by dozens of equations and nearly 400 diagrams."
	},
	{
		"id": "9781338815283",
		"idCategoria": 5,
		"Title": "Harry Potter and the Prisoner of Azkaban",
		"TitleL": "Harry Potter and the Prisoner of Azkaban: MinaLima Edition",
		"Publisher": "Scholastic, Inc.",
		"Date": "10/03/2023",
		"Pages": 400,
		"Tracks": 0,
		"Rating": "",
		"Price": 31.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781338815283.webp?alt=media&token=10d77489-8325-410a-9f01-edb0dcfe392d",
		"Stock": 100,
		"Review": "The third book in the Harry Potter series, illustrated in brilliant full color by MinaLima and featuring eight exclusive interactive elements, including the Marauders Map and more!. Return to Hogwarts in this stunning edition of Harry Potter and the Prisoner of Azkaban. J.K. Rowlings complete and unabridged text is accompanied by full-color illustrations on nearly every page and eight paper-engineered interactive elements: Readers will explore the Knight Bus, reveal the Grim in a teacup, spin the Time-Turner, and more. Designed and illustrated by MinaLima - the award-winning studio behind the graphic style of the Harry Potter films - this keepsake edition is the perfect gift for Harry Potter fans of all ages, a beautiful addition to any collectors bookshelf, and an enchanting way to share this beloved series with a new generation of readers."
	},
	{
		"id": "9781368099387",
		"idCategoria": 5,
		"Title": "The Chalice of the Gods",
		"TitleL": "The Chalice of the Gods (Signed B&N Exclusive Book) (Percy Jackson and the Olympians)",
		"Publisher": "Disney Publishing",
		"Date": "09/26/2023",
		"Pages": 256,
		"Tracks": 0,
		"Rating": "",
		"Price": 19.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/9781368099387.webp?alt=media&token=262244df-3480-4710-8471-f641c561c393",
		"Stock": 100,
		"Review": "The original heroes from The Lightning Thief are reunited for their biggest challenge yet: getting Percy to college when the gods are standing in his way. After saving the world multiple times, Percy Jackson is hoping to have a normal senior year. Unfortunately, the gods arent quite done with him. Percy will have to fulfill three quests in order to get the necessary three letters of recommendation from Mount Olympus for college. The first quest is to help Zeuss cup-bearer retrieve his goblet before it falls into the wrong hands. Can Percy, Grover, and Annabeth find it in time?. Readers new to Percy Jackson and fans who have been awaiting this reunion for more than a decade will delight equally in this latest hilarious take on Greek mythology."
	},
	{
		"id": "0196587072728",
		"idCategoria": 6,
		"Title": "Harrys House",
		"TitleL": "Harrys House",
		"Publisher": "Columbia Records",
		"Date": "05/20/2022",
		"Pages": 0,
		"Tracks": 10,
		"Rating": "",
		"Price": 11.89,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0196587072728.webp?alt=media&token=955cf7bb-0083-4109-9d42-1c50f58c1e38",
		"Stock": 100,
		"Review": "Harry’s House is the third solo studio album from Grammy award-winning global superstar Harry Styles. The 13-track full-length album was recorded in multiple locations across the UK, Los Angeles and Tokyo from 2020 to 2021. It was written by Harry alongside frequent collaborators Kid Harpoon, Tyler Johnson, and Mitch Rowland."
	},
	{
		"id": "0602438737628",
		"idCategoria": 6,
		"Title": "Red Taylors Version",
		"TitleL": "Red Taylors Version (Edited Version)",
		"Publisher": "Republic",
		"Date": "11/12/2021",
		"Pages": 0,
		"Tracks": 12,
		"Rating": "",
		"Price": 15.39,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0602438737628.webp?alt=media&token=47b1f903-e8e5-43fd-9910-58c1aa7ebca1",
		"Stock": 100,
		"Review": ""
	},
	{
		"id": "0194399379721",
		"idCategoria": 6,
		"Title": "30",
		"TitleL": "30",
		"Publisher": "Columbia Records",
		"Date": "11/19/2021",
		"Pages": 0,
		"Tracks": 15,
		"Rating": "",
		"Price": 10.49,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0194399379721.webp?alt=media&token=42aa33b4-9a30-45f8-8075-e3c39b1cb891",
		"Stock": 100,
		"Review": "30 is the first new music from Adele since the release of her third studio album 25 in November 2015. The album is produced with former collaborators Greg Kurstin, Max Martin and Shellback and Tobias Jesso Jr as well as new collaborators Inflo and Ludwig Goransson."
	},
	{
		"id": "0602517229679",
		"idCategoria": 6,
		"Title": "Back to Black",
		"TitleL": "Back to Black",
		"Publisher": "Republic",
		"Date": "03/13/2007",
		"Pages": 0,
		"Tracks": 12,
		"Rating": "",
		"Price": 7.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0602517229679.webp?alt=media&token=27a06cc1-2e55-4acc-82b1-e63d9efbbdb9",
		"Stock": 100,
		"Review": "America was introduced to Amy Winehouse through her second album (her U.K. debut, Frank, saw release during Back to Blacks reign at the top of the charts), but got caught up with storyline quickly enough: Rehab, her inescapable and perfect single, branded her right from the start. Here was Amy, obviously a major vocal talent, but also nearly superheroically self-destructive. Unlike her hometown audience, we never got to hear that expressive, jazz-indebted voice outside of the carnival of tawdriness that has followed Winehouse since Back to Black surfaced, that is, apart from the cartoon. But our gain is an artist fully formed"
	},
	{
		"id": "0786936893625",
		"idCategoria": 7,
		"Title": "Black Panther: Wakanda Forever",
		"TitleL": "Black Panther: Wakanda Forever",
		"Publisher": "Walt Disney Video",
		"Date": "02/07/2023",
		"Pages": 0,
		"Tracks": 12,
		"Rating": "PG-13",
		"Price": 25.19,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0786936893625.webp?alt=media&token=f002ae7d-9d4f-4554-af84-16b946ab12a4",
		"Stock": 100,
		"Review": "On the heels of the unexpected loss of King TChalla, the futuristic, sophisticated nation of Wakanda finds itself at a crossroads in its fate. The surrounding powers of the world look on with greedy eyes, eager to encroach upon Wakanda in its most vulnerable state. All the while, its people remain steadfast, determined to protect their kings legacy and fight for their future."
	},
	{
		"id": "0883929726271",
		"idCategoria": 7,
		"Title": "Elvis",
		"TitleL": "Elvis",
		"Publisher": "Warner Home Video",
		"Date": "09/13/2022",
		"Pages": 0,
		"Tracks": 12,
		"Rating": "PG-13",
		"Price": 27.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0883929726271.webp?alt=media&token=f0b84dbe-b826-495e-b8de-6d3101f89c10",
		"Stock": 100,
		"Review": "Oscar-nominated director Baz Luhrmanns 2022 biographical drama film portrays the life of singer Elvis Presley from childhood until his untimely death at the age of forty-two. Elvis redefines the rock and roll genre through his music. During his rise to fame, he works with manager Colonel Tom Parker and meets the love of his life, Priscilla. Starring Austin Butler, Tom Hanks, Olivia DeJonge, and Dacre Montgomery."
	},
	{
		"id": "0883929266777",
		"idCategoria": 7,
		"Title": "Singin in the Rain",
		"TitleL": "Singin in the Rain",
		"Publisher": "Warner Home Video",
		"Date": "10/02/2012",
		"Pages": 0,
		"Tracks": 12,
		"Rating": "PG-13",
		"Price": 9.99,
		"Image": "https://firebasestorage.googleapis.com/v0/b/knowledgetree-fe84e.appspot.com/o/0883929266777.jpg?alt=media&token=73058dd7-81d7-4977-8f46-c956e650af9f",
		"Stock": 100,
		"Review": "Hollywood, 1927: the silent-film romantic team of Don Lockwood (Gene Kelly) and Lina Lamont (Jean Hagen) is the Toast of Tinseltown. While Lockwood and Lamont personify smoldering passions on screen, in real life the down-to-earth Lockwood cant stand the egotistical, brainless Lina. He prefers the company of aspiring actress Kathy Selden (Debbie Reynolds), whom he met while escaping his screaming fans. Watching these intrigues from the sidelines is Cosmo Brown (Donald OConnor), Dons best pal and on-set pianist."
	}
]